# Onboarding | Customer Onboarding Program | Technical Onboarding Center
- see also https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/blob/main/docs/google-cloud-onboarding.md
- see https://cloud.google.com/onboarding
- launch https://console.cloud.google.com/cloud-setup

## Prepare Before
- billing_project_quota increase from the default 5 - if you prepay $50 and ask for paid services only - quota is usually granted within 3 min by the bot.

## Cloud Setup | Overview
- https://console.cloud.google.com/cloud-setup

<img width="1436" alt="Screenshot 2023-07-04 at 1 07 01 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/5d758ce8-9d53-4111-aa53-b1f0dc99f428">

## Cloud Identity and Organization
<img width="1444" alt="Screenshot 2023-07-04 at 1 07 22 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/768f3d21-0754-4cf9-bf05-16599cea833d">

## Users and Groups
<img width="1437" alt="Screenshot 2023-07-04 at 1 07 51 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/3691851e-bee8-40b1-b020-2f3f4c1c5ec9">

<img width="1437" alt="Screenshot 2023-07-04 at 1 08 49 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/cb496ea0-513c-49c6-aeab-41da57c98688">

<img width="1441" alt="Screenshot 2023-07-04 at 1 09 11 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/e113b6d9-b1a8-4c59-b6da-80d2515215db">

<img width="1436" alt="Screenshot 2023-07-04 at 1 09 36 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/986f3fab-89de-4e43-8bc9-a419f4082e57">

- View groups
- Groups visible in admin
<img width="1424" alt="Screenshot 2023-07-04 at 1 11 06 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/192fcede-bb81-4997-8721-c2b5186a9ccd">
- Same groups visible in the console
<img width="1434" alt="Screenshot 2023-07-04 at 1 10 29 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/ba62935b-88f7-4189-a287-8a6524b6d101">

- Add users to the groups - by default the super admin user you are using is already there
<img width="1432" alt="Screenshot 2023-07-04 at 1 12 05 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/2272fa13-77aa-4053-a011-b2597d92bb62">

<img width="1430" alt="Screenshot 2023-07-04 at 1 17 52 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/fe45e51d-b190-4c3b-ac4c-02958c2c311e">

## Administrative Access
- I already setup the admin user with the following roles - Owner is not recommended
- <img width="1431" alt="Screenshot 2023-07-04 at 1 19 09 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/50e96297-b140-495b-a393-28d12bbc749c">

<img width="1434" alt="Screenshot 2023-07-04 at 1 18 26 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d1607b9b-465a-4433-8672-0d7b179ba6b4">
- add administrative access to the groups themselves
<img width="1437" alt="Screenshot 2023-07-04 at 1 19 55 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/0d670c6c-d8ce-48dd-8815-3006dd3aaaac">

<img width="1426" alt="Screenshot 2023-07-04 at 1 20 53 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/70483fd8-9afb-4f3b-aca5-61eddc151ef2">

## Billing
- already setup for direct billing
<img width="1434" alt="Screenshot 2023-07-04 at 1 21 47 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/68ccf993-aff8-4ff8-94b4-60049930a045">

<img width="1434" alt="Screenshot 2023-07-04 at 1 24 02 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/9243c7e2-7cf4-44d8-9b1b-473d81da99cb">
- confirm billing

## Hierarchy & Access

<img width="1436" alt="Screenshot 2023-07-04 at 1 25 29 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/3ca487d4-db30-4a1e-91a1-c8142fd8a661">
- Request a project quota increase 
- follow https://support.google.com/code/contact/billing_quota_increase and use as a reference https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/blob/main/docs/google-cloud-onboarding.md#quota-increase
- prepay $50 and then ask for under 50 projects (30), use only the paid option

<img width="798" alt="Screenshot 2023-07-04 at 1 30 03 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/63ceba6f-0a00-4a5c-8de6-0c313149c1a6">

<img width="1434" alt="Screenshot 2023-07-04 at 1 26 33 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/87a8c974-585d-4a2f-bc61-2f9a69790622">

- if you prepay $50 and ask for paid services only - quota is usually granted within 3 min by the bot.

<img width="1433" alt="Screenshot 2023-07-04 at 1 43 47 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d70ea689-d2f5-412d-9731-0ae7e10668eb">

- setup resource hierarchy

<img width="1428" alt="Screenshot 2023-07-04 at 1 46 26 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/122cf9ac-b94e-4862-bf95-dd0604c128e4">

- pick full unit/team/environment
<img width="1114" alt="Screenshot 2023-07-04 at 1 48 34 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/fbf49c70-2596-4618-b528-c1e42c3b892e">

<img width="1441" alt="Screenshot 2023-07-04 at 1 50 11 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/fd3b05e6-c3a8-4122-8f33-80489f857fc7">

- move from 3 units to 2
<img width="1435" alt="Screenshot 2023-07-04 at 1 50 58 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/1c580256-b160-47fd-8755-3c5991ba347e">

- delete 2 of 4 teams
<img width="1433" alt="Screenshot 2023-07-04 at 1 58 17 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/764751cf-9739-4af7-9d3c-04df7462ee2f">
- keep 3 environments
<img width="1435" alt="Screenshot 2023-07-04 at 2 01 46 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d448ee27-d2bf-414d-bb16-ca9055b2e4fb">
- reduce the number of projects for now
<img width="1438" alt="Screenshot 2023-07-04 at 2 02 26 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d24af05b-2cbb-4cf5-acd7-e1560b706dec">
- just use 1/1/1 unit/team/env to conserve project resources.
### Configure Access Control

<img width="1446" alt="Screenshot 2023-07-04 at 3 41 24 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/4e19d11d-dfe2-404a-af2a-7d621ce0b653">

<img width="856" alt="Screenshot 2023-07-04 at 3 41 53 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/3c3a9bd6-f60f-4c60-8e90-93fb0fb956ce">


- existing resources list
  
<img width="1432" alt="Screenshot 2023-07-04 at 3 40 45 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/f24321e3-aca0-4ec0-9f45-8f65a90d241a">

- review resources

- <img width="1431" alt="Screenshot 2023-07-04 at 3 51 40 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/4cf5cea8-2ebc-45d1-9ebd-a4125081c602">
- continue to networking
<img width="1427" alt="Screenshot 2023-07-04 at 3 51 14 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/5e7de1cb-47e1-4f64-9d88-ef8e5403f5d2">

## Networking
<img width="1431" alt="Screenshot 2023-07-04 at 3 52 29 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/fec30cb2-93d9-434c-84bb-5be3a3a6ddf5">

<img width="1430" alt="Screenshot 2023-07-04 at 3 54 49 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/231cb7f5-dce1-4246-a129-cb62ba64128b">

### What it is

A VPC network is like a physical network, except virtualized within Google Cloud. It's a global resource that consists of a list of regional subnetworks (subnets). A Shared VPC  is a type of VPC that lets you designate a project as a host project  and attach one or more other service projects  to it. A host project lets you centrally manage routes, firewalls, VPN connections, and subnets as well as share selected subnets, including secondary ranges, with service projects. A service project is any project that's been attached to a host project.

### Examples of what it does
- Provides connectivity for your virtual machine (VM)  and GKE instances 
- Distributes traffic among internal virtual machine (VM) instances within the same region or globally
- Exposes applications with the use of a global or internal load balancer
- Connects to on-premises networks by using Cloud VPN tunnels or VLAN attachments for Cloud Interconnect
- Enables your resources to communicate with each other by using internal IP addresses from a common network

### Why we recommend it
For organizations with multiple teams, Shared VPC provides an effective tool to extend the architectural simplicity of a single VPC network  across multiple working groups. The simplest approach is to deploy a single Shared VPC host project with a single Shared VPC network and then attach service projects to host projects for each of your teams. In this configuration, network policy and control for all networking resources are centralized and easy to manage. It's recommended to use two Shared VPCs to segment non-production and production workloads. Within each Shared VPC, service project departments can configure and manage non-network resources, enabling a clear separation of responsibilities for different teams in the organization. Resources in the service projects can communicate with each other securely and efficiently across project boundaries using internal IP addresses. You can manage shared network resources such as subnets, routes, and firewalls from the central host project allowing you to enforce consistent network policies across projects.

### Key considerations
- Services running in a service project can use Shared VPC to communicate with resources running in the other service projects. It's common to have multiple service projects operated and administered by different departments or teams in your organization.
- A service project can only be associated with a single host project. A service project by default has access to all of the VPCs in the host project it is associated with. A network administrator can grant a service project access to only some subnets.
- Resource quotas  are often applied at the project level (host project) and apply to all Shared VPCs in the same project. Consider the impact of this approach when multiple workloads are leveraging the same resources.
- IAM roles apply at the project level (host project), as opposed to the network or subnet level. If permitted, network and security admins will have the ability to make changes to the network and network security configuration on the host project and all of the host project's Shared VPCs. Administration of IAM roles of compute, storage, and other workload-related resources is defined in the individual service projects.
- By default, resources deployed in different Shared VPCs are unable to communicate with each other. Additional configuration is required to enable cross-VPC communication. Learn more 
- Eligible resources from service projects can use subnets in the Shared VPC network. Learn more

### Configure Networks
- <img width="1434" alt="Screenshot 2023-07-04 at 3 55 20 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/26f6c6c5-1339-4a14-b340-8b60097850e9">
- Configure Shared VPC
<img width="1439" alt="Screenshot 2023-07-04 at 3 56 01 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d7639d97-1264-4596-a609-8e29fb53f55d">
- <img width="1439" alt="Screenshot 2023-07-04 at 3 56 01 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/d7639d97-1264-4596-a609-8e29fb53f55d">
- <img width="572" alt="Screenshot 2023-07-04 at 3 56 50 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/70663d96-1c98-4e0f-9506-31c00f454956">
- <img width="1431" alt="Screenshot 2023-07-04 at 3 59 12 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/4d6723d0-4f1f-446a-832f-13c3a2dfc7d0">

<img width="1441" alt="Screenshot 2023-07-04 at 3 59 48 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/bb02fe9d-0091-4e77-9986-a23cb556379d">
#### Turn off VPC flow logs
- VPC Flow logs are not really required past a couple days - save on costs
<img width="1130" alt="Screenshot 2023-07-04 at 4 00 28 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/9c25d92a-0a14-4455-b4be-8967761c4b81">
#### Create and Connect Service projects later
- https://cloud.google.com/vpc/docs/provisioning-shared-vpc?&_ga=2.63560431.-1155012423.1687982978#create-shared
<img width="1119" alt="Screenshot 2023-07-04 at 4 01 10 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/347dac23-c3d3-4c92-a03b-98c81db1a955">


<img width="1436" alt="Screenshot 2023-07-04 at 4 01 47 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/a810e0cf-c311-46db-b847-823cbac07b75">

## Centralize Logging
<img width="1433" alt="Screenshot 2023-07-04 at 4 02 50 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/b599aeff-a28b-4ddc-95b9-304f2000176d">

<img width="1416" alt="Screenshot 2023-07-04 at 4 05 07 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/557afb3c-0d92-4a3f-bd7d-337ef2c7267b">

<img width="1438" alt="Screenshot 2023-07-04 at 4 03 50 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/be8dde5b-1541-4dd0-8354-b717e4e1efa7">

<img width="1432" alt="Screenshot 2023-07-04 at 4 05 20 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/3da640bf-047d-40c8-9e81-89e7d832d1c6">

<img width="1431" alt="Screenshot 2023-07-04 at 4 05 54 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/91979146-c8f8-4898-a88c-a002720f1c53">

<img width="1427" alt="Screenshot 2023-07-04 at 4 06 17 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/efd1caff-3eaf-423b-a806-3c9eb7c3f82b">

## Deploy Terraform - preview 20230704
- https://cloud.google.com/docs/terraform/deploy-foundation-using-terraform-from-console?_ga=2.125030730.-1155012423.1687982978
<img width="1435" alt="Screenshot 2023-07-04 at 4 06 45 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/ddbea223-a383-49bf-bc92-e6803b6bc05c">

<img width="439" alt="Screenshot 2023-07-04 at 4 07 26 PM" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/94715080/516122c0-7b63-4416-aeee-8736e2bc10a3">

### Run terraform in cloud shell

```
To set your Cloud Platform project in this session use “gcloud config set project [PROJECT_ID]”
michael@cloudshell:~$ gcloud config set project cs-host-6e8fdca189434184a30c0c
Updated property [core/project].
michael@cloudshell:~ (cs-host-6e8fdca189434184a30c0c)$ mkdir terraform
michael@cloudshell:~ (cs-host-6e8fdca189434184a30c0c)$ cd terraform/
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ terraform -version
Terraform v1.5.1
on linux_amd64

Your version of Terraform is out of date! The latest version
is 1.5.2. You can update by downloading from https://www.terraform.io/downloads.html
```
Upload back to GCP
<img width="353" alt="Screenshot 2023-07-07 at 12 38 29" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/e5bf07db-c542-482f-99fd-ce8ad64c649e">

```
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ ls
terraform.tar.gz
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ tar -xvf terraform.tar.gz 
folders.tf
iam.tf
log-export.tf
network.tf
projects.tf
variables.tf
versions.tf
README.md

michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ export PROJECT_ID=cs-host-6e8fdca18943418....
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ export ORG_ID=9948008....
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ export EMAIL_ID=michael@obr...

gcloud organizations add-iam-policy-binding "${ORG_ID}" --member "user:${EMAIL_ID}" --role roles/billing.admin
gcloud organizations add-iam-policy-binding "${ORG_ID}" --member "user:${EMAIL_ID}" --role roles/resourcemanager.organizationAdmi
gcloud organizations add-iam-policy-binding "${ORG_ID}" --member "user:${EMAIL_ID}" --role roles/resourcemanager.folderCreator
gcloud organizations add-iam-policy-binding "${ORG_ID}" --member "user:${EMAIL_ID}" --role roles/resourcemanager.projectCreator

michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$ terraform init

Initializing the backend...
Initializing modules...
Downloading registry.terraform.io/terraform-google-modules/folders/google 3.2.0 for cs-common...
- cs-common in .terraform/modules/cs-common
Downloading registry.terraform.io/terraform-google-modules/folders/google 3.2.0 for cs-divisions...
- cs-divisions in .terraform/modules/cs-divisions
Downloading registry.terraform.io/terraform-google-modules/folders/google 3.2.0 for cs-envs...
- cs-envs in .terraform/modules/cs-envs
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-folders-iam-0-computeinstanceAdminv1...
- cs-folders-iam-0-computeinstanceAdminv1 in .terraform/modules/cs-folders-iam-0-computeinstanceAdminv1/modules/folders_iam
- cs-folders-iam-0-computeinstanceAdminv1.helper in .terraform/modules/cs-folders-iam-0-computeinstanceAdminv1/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-folders-iam-0-containeradmin...
- cs-folders-iam-0-containeradmin in .terraform/modules/cs-folders-iam-0-containeradmin/modules/folders_iam
- cs-folders-iam-0-containeradmin.helper in .terraform/modules/cs-folders-iam-0-containeradmin/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-folders-iam-1-computeinstanceAdminv1...
- cs-folders-iam-1-computeinstanceAdminv1 in .terraform/modules/cs-folders-iam-1-computeinstanceAdminv1/modules/folders_iam
- cs-folders-iam-1-computeinstanceAdminv1.helper in .terraform/modules/cs-folders-iam-1-computeinstanceAdminv1/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-folders-iam-1-containeradmin...
- cs-folders-iam-1-containeradmin in .terraform/modules/cs-folders-iam-1-containeradmin/modules/folders_iam
- cs-folders-iam-1-containeradmin.helper in .terraform/modules/cs-folders-iam-1-containeradmin/modules/helper
Downloading registry.terraform.io/terraform-google-modules/log-export/google 7.4.3 for cs-logging-destination...
- cs-logging-destination in .terraform/modules/cs-logging-destination/modules/logbucket
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-logging-hh015-gz357...
- cs-logging-hh015-gz357 in .terraform/modules/cs-logging-hh015-gz357
- cs-logging-hh015-gz357.budget in .terraform/modules/cs-logging-hh015-gz357/modules/budget
- cs-logging-hh015-gz357.essential_contacts in .terraform/modules/cs-logging-hh015-gz357/modules/essential_contacts
- cs-logging-hh015-gz357.gsuite_group in .terraform/modules/cs-logging-hh015-gz357/modules/gsuite_group
- cs-logging-hh015-gz357.project-factory in .terraform/modules/cs-logging-hh015-gz357/modules/core_project_factory
- cs-logging-hh015-gz357.project-factory.project_services in .terraform/modules/cs-logging-hh015-gz357/modules/project_services
- cs-logging-hh015-gz357.quotas in .terraform/modules/cs-logging-hh015-gz357/modules/quota_manager
- cs-logging-hh015-gz357.shared_vpc_access in .terraform/modules/cs-logging-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/log-export/google 7.3.0 for cs-logsink-logbucketsink...
- cs-logsink-logbucketsink in .terraform/modules/cs-logsink-logbucketsink
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-monitoring-dev-hh015-gz357...
- cs-monitoring-dev-hh015-gz357 in .terraform/modules/cs-monitoring-dev-hh015-gz357
- cs-monitoring-dev-hh015-gz357.budget in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/budget
- cs-monitoring-dev-hh015-gz357.essential_contacts in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/essential_contacts
- cs-monitoring-dev-hh015-gz357.gsuite_group in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/gsuite_group
- cs-monitoring-dev-hh015-gz357.project-factory in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/core_project_factory
- cs-monitoring-dev-hh015-gz357.project-factory.project_services in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/project_services
- cs-monitoring-dev-hh015-gz357.quotas in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/quota_manager
- cs-monitoring-dev-hh015-gz357.shared_vpc_access in .terraform/modules/cs-monitoring-dev-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-monitoring-nonprod-hh015-gz357...
- cs-monitoring-nonprod-hh015-gz357 in .terraform/modules/cs-monitoring-nonprod-hh015-gz357
- cs-monitoring-nonprod-hh015-gz357.budget in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/budget
- cs-monitoring-nonprod-hh015-gz357.essential_contacts in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/essential_contacts
- cs-monitoring-nonprod-hh015-gz357.gsuite_group in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/gsuite_group
- cs-monitoring-nonprod-hh015-gz357.project-factory in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/core_project_factory
- cs-monitoring-nonprod-hh015-gz357.project-factory.project_services in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/project_services
- cs-monitoring-nonprod-hh015-gz357.quotas in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/quota_manager
- cs-monitoring-nonprod-hh015-gz357.shared_vpc_access in .terraform/modules/cs-monitoring-nonprod-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-monitoring-prod-hh015-gz357...
- cs-monitoring-prod-hh015-gz357 in .terraform/modules/cs-monitoring-prod-hh015-gz357
- cs-monitoring-prod-hh015-gz357.budget in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/budget
- cs-monitoring-prod-hh015-gz357.essential_contacts in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/essential_contacts
- cs-monitoring-prod-hh015-gz357.gsuite_group in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/gsuite_group
- cs-monitoring-prod-hh015-gz357.project-factory in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/core_project_factory
- cs-monitoring-prod-hh015-gz357.project-factory.project_services in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/project_services
- cs-monitoring-prod-hh015-gz357.quotas in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/quota_manager
- cs-monitoring-prod-hh015-gz357.shared_vpc_access in .terraform/modules/cs-monitoring-prod-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-projects-iam-2-bigquerydataViewer...
- cs-projects-iam-2-bigquerydataViewer in .terraform/modules/cs-projects-iam-2-bigquerydataViewer/modules/projects_iam
- cs-projects-iam-2-bigquerydataViewer.helper in .terraform/modules/cs-projects-iam-2-bigquerydataViewer/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-projects-iam-2-loggingprivateLogViewer...
- cs-projects-iam-2-loggingprivateLogViewer in .terraform/modules/cs-projects-iam-2-loggingprivateLogViewer/modules/projects_iam
- cs-projects-iam-2-loggingprivateLogViewer.helper in .terraform/modules/cs-projects-iam-2-loggingprivateLogViewer/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-projects-iam-2-loggingviewer...
- cs-projects-iam-2-loggingviewer in .terraform/modules/cs-projects-iam-2-loggingviewer/modules/projects_iam
- cs-projects-iam-2-loggingviewer.helper in .terraform/modules/cs-projects-iam-2-loggingviewer/modules/helper
Downloading registry.terraform.io/terraform-google-modules/iam/google 7.6.0 for cs-projects-iam-3-bigquerydataViewer...
- cs-projects-iam-3-bigquerydataViewer in .terraform/modules/cs-projects-iam-3-bigquerydataViewer/modules/projects_iam
- cs-projects-iam-3-bigquerydataViewer.helper in .terraform/modules/cs-projects-iam-3-bigquerydataViewer/modules/helper
Downloading registry.terraform.io/terraform-google-modules/folders/google 3.2.0 for cs-teams...
- cs-teams in .terraform/modules/cs-teams
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-vpc-host-nonprod-hh015-gz357...
- cs-vpc-host-nonprod-hh015-gz357 in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357
- cs-vpc-host-nonprod-hh015-gz357.budget in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/budget
- cs-vpc-host-nonprod-hh015-gz357.essential_contacts in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/essential_contacts
- cs-vpc-host-nonprod-hh015-gz357.gsuite_group in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/gsuite_group
- cs-vpc-host-nonprod-hh015-gz357.project-factory in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/core_project_factory
- cs-vpc-host-nonprod-hh015-gz357.project-factory.project_services in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/project_services
- cs-vpc-host-nonprod-hh015-gz357.quotas in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/quota_manager
- cs-vpc-host-nonprod-hh015-gz357.shared_vpc_access in .terraform/modules/cs-vpc-host-nonprod-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 14.2.1 for cs-vpc-host-prod-hh015-gz357...
- cs-vpc-host-prod-hh015-gz357 in .terraform/modules/cs-vpc-host-prod-hh015-gz357
- cs-vpc-host-prod-hh015-gz357.budget in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/budget
- cs-vpc-host-prod-hh015-gz357.essential_contacts in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/essential_contacts
- cs-vpc-host-prod-hh015-gz357.gsuite_group in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/gsuite_group
- cs-vpc-host-prod-hh015-gz357.project-factory in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/core_project_factory
- cs-vpc-host-prod-hh015-gz357.project-factory.project_services in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/project_services
- cs-vpc-host-prod-hh015-gz357.quotas in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/quota_manager
- cs-vpc-host-prod-hh015-gz357.shared_vpc_access in .terraform/modules/cs-vpc-host-prod-hh015-gz357/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/network/google 5.2.0 for cs-vpc-nonprod-shared...
- cs-vpc-nonprod-shared in .terraform/modules/cs-vpc-nonprod-shared
- cs-vpc-nonprod-shared.firewall_rules in .terraform/modules/cs-vpc-nonprod-shared/modules/firewall-rules
- cs-vpc-nonprod-shared.routes in .terraform/modules/cs-vpc-nonprod-shared/modules/routes
- cs-vpc-nonprod-shared.subnets in .terraform/modules/cs-vpc-nonprod-shared/modules/subnets
- cs-vpc-nonprod-shared.vpc in .terraform/modules/cs-vpc-nonprod-shared/modules/vpc
Downloading registry.terraform.io/terraform-google-modules/network/google 5.2.0 for cs-vpc-prod-shared...
- cs-vpc-prod-shared in .terraform/modules/cs-vpc-prod-shared
- cs-vpc-prod-shared.firewall_rules in .terraform/modules/cs-vpc-prod-shared/modules/firewall-rules
- cs-vpc-prod-shared.routes in .terraform/modules/cs-vpc-prod-shared/modules/routes
- cs-vpc-prod-shared.subnets in .terraform/modules/cs-vpc-prod-shared/modules/subnets
- cs-vpc-prod-shared.vpc in .terraform/modules/cs-vpc-prod-shared/modules/vpc

Initializing provider plugins...
- Finding hashicorp/null versions matching ">= 2.1.0"...
- Finding hashicorp/google versions matching ">= 2.12.0, >= 3.43.0, >= 3.45.0, >= 3.50.0, >= 3.53.0, >= 3.83.0, >= 4.0.0, ~> 4.28, < 5.0.0"...
- Finding hashicorp/random versions matching ">= 2.2.0"...
- Finding hashicorp/google-beta versions matching ">= 3.43.0, >= 3.45.0, >= 3.50.0, ~> 4.11, ~> 4.28, < 5.0.0"...
- Finding hashicorp/time versions matching ">= 0.5.0"...
- Installing hashicorp/null v3.2.1...
- Installed hashicorp/null v3.2.1 (signed by HashiCorp)
- Installing hashicorp/google v4.72.1...
- Installed hashicorp/google v4.72.1 (signed by HashiCorp)
- Installing hashicorp/random v3.5.1...
- Installed hashicorp/random v3.5.1 (signed by HashiCorp)
- Installing hashicorp/google-beta v4.72.1...
- Installed hashicorp/google-beta v4.72.1 (signed by HashiCorp)
- Installing hashicorp/time v0.9.1...
- Installed hashicorp/time v0.9.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
michael@cloudshell:~/terraform (cs-host-6e8fdca189434184a30c0c)$

```

### terraform plan
```
terraform plan

Plan: 63 to add, 0 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # random_id.suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 4
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-common.google_folder.folders["Common"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Common"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = "organizations/994800875199"
    }

[1m  # module.cs-divisions.google_folder.folders["Department 1"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Department 1"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = "organizations/994800875199"
    }

[1m  # module.cs-envs["Department 1-Team 1"].google_folder.folders["Development"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Development"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = (known after apply)
    }

[1m  # module.cs-envs["Department 1-Team 1"].google_folder.folders["Non-Production"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Non-Production"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = (known after apply)
    }

[1m  # module.cs-envs["Department 1-Team 1"].google_folder.folders["Production"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Production"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = (known after apply)
    }

[1m  # module.cs-folders-iam-0-computeinstanceAdminv1.google_folder_iam_member.folder_iam_additive["default--roles/compute.instanceAdmin.v1--group:gcp-developers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_folder_iam_member" "folder_iam_additive" {
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m folder = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = (known after apply)
    }

[1m  # module.cs-folders-iam-0-containeradmin.google_folder_iam_member.folder_iam_additive["default--roles/container.admin--group:gcp-developers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_folder_iam_member" "folder_iam_additive" {
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m folder = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = (known after apply)
    }

[1m  # module.cs-folders-iam-1-computeinstanceAdminv1.google_folder_iam_member.folder_iam_additive["default--roles/compute.instanceAdmin.v1--group:gcp-developers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_folder_iam_member" "folder_iam_additive" {
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m folder = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = (known after apply)
    }

[1m  # module.cs-folders-iam-1-containeradmin.google_folder_iam_member.folder_iam_additive["default--roles/container.admin--group:gcp-developers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_folder_iam_member" "folder_iam_additive" {
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m folder = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = (known after apply)
    }

[1m  # module.cs-logging-destination.google_logging_project_bucket_config.bucket[0m will be created
[0m  [32m+[0m[0m resource "google_logging_project_bucket_config" "bucket" {
      [32m+[0m[0m bucket_id       = (known after apply)
      [32m+[0m[0m description     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m location        = "global"
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m project         = "logging-hh015-gz357"
      [32m+[0m[0m retention_days  = 365
    }

[1m  # module.cs-logging-destination.google_project_iam_member.logbucket_sink_member[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "logbucket_sink_member" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = (known after apply)
      [32m+[0m[0m project = "logging-hh015-gz357"
      [32m+[0m[0m role    = "roles/logging.bucketWriter"
    }

[1m  # module.cs-logging-destination.google_project_service.enable_destination_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "enable_destination_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "logging-hh015-gz357"
      [32m+[0m[0m service            = "logging.googleapis.com"
    }

[1m  # module.cs-logsink-logbucketsink.google_logging_organization_sink.sink[0][0m will be created
[0m  [32m+[0m[0m resource "google_logging_organization_sink" "sink" {
      [32m+[0m[0m destination      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m include_children = true
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m org_id           = "994800875199"
      [32m+[0m[0m writer_identity  = (known after apply)
    }

[1m  # module.cs-projects-iam-2-bigquerydataViewer.google_project_iam_member.project_iam_additive["default--roles/bigquery.dataViewer--group:gcp-logging-viewers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "project_iam_additive" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "group:gcp-logging-viewers@obrien.software"
      [32m+[0m[0m project = "logging-hh015-gz357"
      [32m+[0m[0m role    = "roles/bigquery.dataViewer"
    }

[1m  # module.cs-projects-iam-2-loggingprivateLogViewer.google_project_iam_member.project_iam_additive["default--roles/logging.privateLogViewer--group:gcp-logging-viewers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "project_iam_additive" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "group:gcp-logging-viewers@obrien.software"
      [32m+[0m[0m project = "logging-hh015-gz357"
      [32m+[0m[0m role    = "roles/logging.privateLogViewer"
    }

[1m  # module.cs-projects-iam-2-loggingviewer.google_project_iam_member.project_iam_additive["default--roles/logging.viewer--group:gcp-logging-viewers@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "project_iam_additive" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "group:gcp-logging-viewers@obrien.software"
      [32m+[0m[0m project = "logging-hh015-gz357"
      [32m+[0m[0m role    = "roles/logging.viewer"
    }

[1m  # module.cs-projects-iam-3-bigquerydataViewer.google_project_iam_member.project_iam_additive["default--roles/bigquery.dataViewer--group:gcp-security-admins@obrien.software"][0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "project_iam_additive" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "group:gcp-security-admins@obrien.software"
      [32m+[0m[0m project = "logging-hh015-gz357"
      [32m+[0m[0m role    = "roles/bigquery.dataViewer"
    }

[1m  # module.cs-teams["Department 1"].google_folder.folders["Team 1"][0m will be created
[0m  [32m+[0m[0m resource "google_folder" "folders" {
      [32m+[0m[0m create_time     = (known after apply)
      [32m+[0m[0m display_name    = "Team 1"
      [32m+[0m[0m folder_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m lifecycle_state = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m parent          = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "logging-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "01...4"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "logging"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "logging-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "logging-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "logging Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "logging-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-dev-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "0...4"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "monitoring-dev"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-dev-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "monitoring-dev-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "monitoring-dev Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "monitoring-dev-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-nonprod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "0...54"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "monitoring-nonprod"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-nonprod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "monitoring-nonprod-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "monitoring-nonprod Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "monitoring-nonprod-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-prod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "01...54"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "monitoring-prod"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "monitoring-prod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "monitoring-prod-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "monitoring-prod Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "monitoring-prod-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.google_compute_shared_vpc_host_project.shared_vpc_host[0][0m will be created
[0m  [32m+[0m[0m resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m project = "vpc-host-nonprod-hh015-gz357"
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "01...54"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "vpc-host-nonprod"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "vpc-host-nonprod Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.budget.data.google_project.project[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "google_project" "project" {
      [32m+[0m[0m auto_create_network = (known after apply)
      [32m+[0m[0m billing_account     = (known after apply)
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m labels              = (known after apply)
      [32m+[0m[0m name                = (known after apply)
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.google_compute_shared_vpc_host_project.shared_vpc_host[0][0m will be created
[0m  [32m+[0m[0m resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m project = "vpc-host-prod-hh015-gz357"
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.google_project.main[0m will be created
[0m  [32m+[0m[0m resource "google_project" "main" {
      [32m+[0m[0m auto_create_network = false
      [32m+[0m[0m billing_account     = "0...54"
      [32m+[0m[0m folder_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "vpc-host-prod"
      [32m+[0m[0m number              = (known after apply)
      [32m+[0m[0m org_id              = (known after apply)
      [32m+[0m[0m project_id          = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m skip_delete         = (known after apply)
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.google_project_default_service_accounts.default_service_accounts[0][0m will be created
[0m  [32m+[0m[0m resource "google_project_default_service_accounts" "default_service_accounts" {
      [32m+[0m[0m action           = "DISABLE"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m project          = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      [32m+[0m[0m service_accounts = (known after apply)
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.google_service_account.default_service_account[0][0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "default_service_account" {
      [32m+[0m[0m account_id   = "project-service-account"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "vpc-host-prod Project Service Account"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.random_id.random_project_id_suffix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "random_project_id_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 2
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cs-vpc-nonprod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-nonprod-shared-allow-icmp"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-nonprod-shared-allow-icmp"
      [32m+[0m[0m network            = "vpc-nonprod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "10.128.0.0/9",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = []
          [32m+[0m[0m protocol = "icmp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-nonprod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-nonprod-shared-allow-rdp"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-nonprod-shared-allow-rdp"
      [32m+[0m[0m network            = "vpc-nonprod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "35.235.240.0/20",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = [
              [32m+[0m[0m "3389",
            ]
          [32m+[0m[0m protocol = "tcp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-nonprod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-nonprod-shared-allow-ssh"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-nonprod-shared-allow-ssh"
      [32m+[0m[0m network            = "vpc-nonprod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "35.235.240.0/20",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = [
              [32m+[0m[0m "22",
            ]
          [32m+[0m[0m protocol = "tcp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-nonprod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast1/subnet-non-prod-1"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnetwork" {
      [32m+[0m[0m creation_timestamp         = (known after apply)
      [32m+[0m[0m external_ipv6_prefix       = (known after apply)
      [32m+[0m[0m fingerprint                = (known after apply)
      [32m+[0m[0m gateway_address            = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ip_cidr_range              = "10.10.0.0/16"
      [32m+[0m[0m ipv6_cidr_range            = (known after apply)
      [32m+[0m[0m name                       = "subnet-non-prod-1"
      [32m+[0m[0m network                    = "vpc-nonprod-shared"
      [32m+[0m[0m private_ip_google_access   = true
      [32m+[0m[0m private_ipv6_google_access = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m purpose                    = (known after apply)
      [32m+[0m[0m region                     = "northamerica-northeast1"
      [32m+[0m[0m secondary_ip_range         = []
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m stack_type                 = (known after apply)
    }

[1m  # module.cs-vpc-nonprod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast2/subnet-non-prod-2"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnetwork" {
      [32m+[0m[0m creation_timestamp         = (known after apply)
      [32m+[0m[0m external_ipv6_prefix       = (known after apply)
      [32m+[0m[0m fingerprint                = (known after apply)
      [32m+[0m[0m gateway_address            = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ip_cidr_range              = "10.20.0.0/16"
      [32m+[0m[0m ipv6_cidr_range            = (known after apply)
      [32m+[0m[0m name                       = "subnet-non-prod-2"
      [32m+[0m[0m network                    = "vpc-nonprod-shared"
      [32m+[0m[0m private_ip_google_access   = true
      [32m+[0m[0m private_ipv6_google_access = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m purpose                    = (known after apply)
      [32m+[0m[0m region                     = "northamerica-northeast2"
      [32m+[0m[0m secondary_ip_range         = []
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m stack_type                 = (known after apply)
    }

[1m  # module.cs-vpc-nonprod-shared.module.vpc.google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-nonprod-shared"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1m  # module.cs-vpc-prod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-prod-shared-allow-icmp"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-prod-shared-allow-icmp"
      [32m+[0m[0m network            = "vpc-prod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "10.128.0.0/9",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = []
          [32m+[0m[0m protocol = "icmp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-prod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-prod-shared-allow-rdp"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-prod-shared-allow-rdp"
      [32m+[0m[0m network            = "vpc-prod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "35.235.240.0/20",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = [
              [32m+[0m[0m "3389",
            ]
          [32m+[0m[0m protocol = "tcp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-prod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-prod-shared-allow-ssh"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "rules" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = "INGRESS"
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "vpc-prod-shared-allow-ssh"
      [32m+[0m[0m network            = "vpc-prod-shared"
      [32m+[0m[0m priority           = 10000
      [32m+[0m[0m project            = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "35.235.240.0/20",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = [
              [32m+[0m[0m "22",
            ]
          [32m+[0m[0m protocol = "tcp"
        }

      [32m+[0m[0m log_config {
          [32m+[0m[0m metadata = "INCLUDE_ALL_METADATA"
        }
    }

[1m  # module.cs-vpc-prod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast1/subnet-prod-1"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnetwork" {
      [32m+[0m[0m creation_timestamp         = (known after apply)
      [32m+[0m[0m external_ipv6_prefix       = (known after apply)
      [32m+[0m[0m fingerprint                = (known after apply)
      [32m+[0m[0m gateway_address            = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ip_cidr_range              = "10.1.0.0/24"
      [32m+[0m[0m ipv6_cidr_range            = (known after apply)
      [32m+[0m[0m name                       = "subnet-prod-1"
      [32m+[0m[0m network                    = "vpc-prod-shared"
      [32m+[0m[0m private_ip_google_access   = true
      [32m+[0m[0m private_ipv6_google_access = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m purpose                    = (known after apply)
      [32m+[0m[0m region                     = "northamerica-northeast1"
      [32m+[0m[0m secondary_ip_range         = []
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m stack_type                 = (known after apply)
    }

[1m  # module.cs-vpc-prod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast2/subnet-prod-2"][0m will be created
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnetwork" {
      [32m+[0m[0m creation_timestamp         = (known after apply)
      [32m+[0m[0m external_ipv6_prefix       = (known after apply)
      [32m+[0m[0m fingerprint                = (known after apply)
      [32m+[0m[0m gateway_address            = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ip_cidr_range              = "10.2.0.0/24"
      [32m+[0m[0m ipv6_cidr_range            = (known after apply)
      [32m+[0m[0m name                       = "subnet-prod-2"
      [32m+[0m[0m network                    = "vpc-prod-shared"
      [32m+[0m[0m private_ip_google_access   = true
      [32m+[0m[0m private_ipv6_google_access = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m purpose                    = (known after apply)
      [32m+[0m[0m region                     = "northamerica-northeast2"
      [32m+[0m[0m secondary_ip_range         = []
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m stack_type                 = (known after apply)
    }

[1m  # module.cs-vpc-prod-shared.module.vpc.google_compute_network.network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "network" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = 0
      [32m+[0m[0m name                                      = "vpc-prod-shared"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m routing_mode                              = "GLOBAL"
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1m  # module.cs-logging-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "logging-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1m  # module.cs-monitoring-dev-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "monitoring-dev-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1m  # module.cs-monitoring-nonprod-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "monitoring-nonprod-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1m  # module.cs-monitoring-prod-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "monitoring-prod-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1m  # module.cs-vpc-host-nonprod-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-nonprod-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1m  # module.cs-vpc-host-prod-hh015-gz357.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "project_services" {
      [32m+[0m[0m disable_dependent_services = true
      [32m+[0m[0m disable_on_destroy         = true
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m project                    = "vpc-host-prod-hh015-gz357"
      [32m+[0m[0m service                    = "compute.googleapis.com"
    }

[1mPlan:[0m 63 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

### terraform apply

```
Terraform apply
Plan: 63 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes


module.cs-vpc-prod-shared.module.vpc.google_compute_network.network: Creation complete after 21s [id=projects/vpc-host-prod-hh015-gz357/global/networks/vpc-prod-shared]
module.cs-vpc-prod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast1/subnet-prod-1"]: Creating...
module.cs-vpc-prod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast2/subnet-prod-2"]: Creating...
module.cs-vpc-prod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-prod-shared-allow-icmp"]: Creating...
module.cs-vpc-prod-shared.module.firewall_rules.google_compute_firewall.rules["vpc-prod-shared-allow-rdp"]: Creating...
module.cs-vpc-prod-shared.module.subnets.google_compute_subnetwork.subnetwork["northamerica-northeast1/subnet-prod-1"]: Creation complete after 25s [id=projects/vpc-host-prod-hh015-gz357/regions/northamerica-northeast1/subnetworks/subnet-prod-1]

Apply complete! Resources: 63 added, 0 changed, 0 destroyed.
```
1250-1254

### Complete 4 min

Project List
<img width="831" alt="Screenshot 2023-07-07 at 12 56 04" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/fc8aeeb7-abac-4d62-98a8-375388114eab">

Recource Hierarchy
<img width="1408" alt="Screenshot 2023-07-07 at 12 55 39" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/c1182aaf-b824-42bd-8f6d-a26873635dac">

Asset Inventory

<img width="587" alt="Screenshot 2023-07-07 at 12 56 47" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/bf3471c0-fbb0-4575-9eb0-72e0830fc1a7">

### VPC for Non-Prod Prod Host Project
- Linking service projects created under teams is pending
<img width="1933" alt="Screenshot 2023-07-07 at 13 00 21" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/6e09e50d-fa81-4e99-960e-70b0571b1d57">

### Monitoring : 
### Security : Organization Policies

<img width="1214" alt="Screenshot 2023-07-07 at 13 02 47" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/03f87edd-eec1-461e-af4d-b8c8450da24c">

<img width="1020" alt="Screenshot 2023-07-07 at 13 03 03" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/bea6f829-8b80-4009-90bd-c07bb7fe76a4">

<img width="881" alt="Screenshot 2023-07-07 at 13 03 21" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/4b9aae33-ed99-4967-b85e-28fe19e87f96">

However - testing only 1 for now

<img width="933" alt="Screenshot 2023-07-07 at 13 04 15" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/c35a1c60-5c85-42be-9625-f9ee25e51ca6">

## Finalize

<img width="1128" alt="Screenshot 2023-07-07 at 13 05 06" src="https://github.com/CloudLandingZone/google-cloud-enterprise-setup-checklist/assets/24765473/06230064-ff68-4f70-b421-87124c8546ce">
